import java.io.IOException;

/*
Реализовать регистрацию и авторизацию в чате. Механизм подключения- пользователь получается от сервера
на выбор 2 действия- авторизоваться и зарегистристрироваться. Если выбрана регистрация- пользователь
вводит последовательно логин и пароль. Такой пользователь регистрируется в системе (хранится на сервере).
Если выбрана авторизация- пользователь вводит логин и пароль, и если они найдены в системе- может продолжать чат.
Если введены неверные данные- система выдает сообщение об ошибке.
+ Предусмотреть механизм смены регистрационных данных
 */
public class Main {

    public static void main(String[] args) throws IOException {
    }
}
